// Завдання 1
function random(min, max) {
    return min + Math.random() * (max - min); // Генеруємо випадкове число в заданому діапазоні
}

// Завдання 2
function isPrime(num) {
    if (num <= 1) return false; // Виходить, що числа менше або рівно 1 не є простими
    if (num === 2) return true; // 2 є простим числом
    for (let i = 2; i <= Math.sqrt(num); i++) {
        if (num % i === 0) return false; // Якщо число ділиться націло на число з діапазону [2, корінь з числа], воно не є простим
    }
    return true; // Якщо жодне число з діапазону [2, корінь з числа] не поділило число num, воно є простим
}

// Завдання 3
function sumSequence(n) {
    if (n >= 1) {
        return (n * (n + 1)) / 2; // Формула для обчислення суми послідовності чисел від 1 до n
    } else {
        return (n * (n - 1)) / 2; // Формула для обчислення суми послідовності чисел від n до 1 при n < 0
    }
}